# 选修课统计，本学期学校共开设了3门选修课，一个班有25位学生，选修的情况如下：
# 选修1号课程的同学有：
# set1 = {'张三', '李四', '王五', '马六', '赵七', '钱八'}
# 选修2号课程的同学有：
# set2 = {'姬一', '孙必', '周冲', '王五', '方向', '张玉'}
# 选修3号课程的同学有：
# set3 = {'刘玉', '王五', '方向', '孙身', '陈红', '马六'}
# 请编写程序解决以下问题：
# 1、这个班有多少位学生没有选课？
# 2、有多少位学生同时选修了3门课？
# 3、有多少位学生同时选修了2门课？(不包含选3门的)
# 4、有多少位学生同时选修了一门课？

set1 = {'张三', '李四', '王五', '马六', '赵七', '钱八'}
set2 = {'姬一', '孙必', '周冲', '王五', '方向', '张玉'}
set3 = {'刘玉', '王五', '方向', '孙身', '陈红', '马六'}
set4=set1|set2|set3
print(25-len(set4))

set5=set1&set2&set3
print(set5)

set6=((set1&set2)|(set1&set3)|(set2&set3))-(set1&set2&set3)
print(set6)

set7=set1-set2-set3
print(set7)